Repository: tc-ca/CCMS-SGCR
Catalog: HRCMS/Resources/Views/HRCase/Details.*.resx
Languages: fr

source: &lt;acronym title='Personal Record Identifier'&gt;PRI&lt;/acronym&gt;
fr: <acronym title='Personal Record Identifier(fr)'>PRI(fr)</acronym>

source: Are you sure?
fr: Are you sure? (fr)

source: Attachments
fr: Attachments (fr)

source: Back to List
fr: Back to List (fr)

source: Cancel
fr: Cancel (fr)

source: Case Status
fr: Case Status (fr)

source: Case Sub Type
fr: Case Sub Type (fr)

source: Case Type
fr: Case Type (fr)

source: Confirm
fr: Confirm (fr)

source: Create New Case
fr: Create New Case (fr)

source: Created On
fr: Created On (fr)

source: Delete
fr: Delete (fr)

source: Description
fr: Description (fr)

source: Email
fr: Email (fr)

source: File Name
fr: File Name (fr)

source: First Name
fr: First Name (fr)

source: General
fr: General (fr)

source: Pay Case
fr: Pay Case (fr)

source: Last Name
fr: Last Name (fr)

source: N/A
fr: N/A (fr)

source: Note Text
fr: Note Text (fr)

source: Questions and Answers
fr: Questions and Answers (fr)

source: Received by Pay
fr: Received by Pay (fr)

source: Resolution
fr: Resolution (fr)

source: Subject
fr: Subject (fr)

source: Submit
fr: Submit (fr)

source: Submit Answers
fr: Submit Answers (fr)

source: Update
fr: Update (fr)

source: Withdraw
fr: Withdraw (fr)
